//=============================================================================
//
// 画面全体を覆う処理 [coverDisplay.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _COVER_DISPLAY_H_
#define _COVER_DISPLAY_H_

#include "object2D.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
//前方宣言
//*****************************************************************************

//*****************************************************************************
// クラスの定義
//*****************************************************************************
class CCoverDisplay : public CObject2D
{
public:
	CCoverDisplay();	//デフォルトコンストラクタ
	~CCoverDisplay();	//デストラクタ
	static CCoverDisplay* Create(D3DXCOLOR col);	//生成処理
	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理
	void Draw(void);	//描画処理

private:

};

#endif // !_COVER_DISPLAY_H_