//=============================================================================
//
// クレジットシーン処理 [creditScene.h]
// Author : 加藤瑞葵
//
//=============================================================================
#ifndef _CREDIT_SCENE_H_
#define _CREDIT_SCENE_H_

#include "scene.h"
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CObject2D;
class CNextButton;

//*****************************************************************************
// リザルトシーンクラス
//*****************************************************************************
class CCreditScene : public CScene
{
public:
	CCreditScene();				//デフォルトコンストラクタ
	virtual ~CCreditScene();	//デストラクタ
	void Init(void);			//初期化処理
	void CreateObject(void);	//オブジェクト生成処理
	void Uninit(void);			//終了処理
	void Update(void);			//更新処理

private:
	void Bg();				//背景処理
	void Fade();			//遷移処理
	void Credit();			//クレジット処理
	void CreatePicture();	//絵生成処理

	CObject2D *m_pBg;				//背景
	CObject2D *m_pCredit;			//クレジット
	bool m_bCanFade;				//フェードできるかどうか
	int m_nFrameCounter;			//Frameカウント用
};

#endif // !_CREDIT_SCENE_H_