//=============================================================================
//
// 最終結果シーン処理 [finalResultScene.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _FINAL_RESULT_SCENE_H_
#define _FINAL_RESULT_SCENE_H_

#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CObject2D;
class CObjectModel;

//*****************************************************************************
// 最終結果シーンクラス
//*****************************************************************************
class CFinalResultScene : public CScene
{
public:
	CFinalResultScene();	//デフォルトコンストラクタ
	virtual ~CFinalResultScene();	//デストラクタ
	void Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理

private:
	void UpdateInput(void);	//入力処理

	CObjectModel* m_apObjPlayer[4];		//プレイヤーのモデルオブジェクト
	CObjectModel* m_apResultTower[4];	//プレイヤーの下にあるタワーのモデルオブジェクト
	int m_nFadeTime;	//フェード開始までのカウント
	bool m_bSelectGame;	//選択キー押下時

};

#endif // !_FINAL_RESULT_SCENE_H_