//=============================================================================
//
// 人狼決定シーンカメラ処理 [find_wolf_camera.h]
// Author : 加藤瑞葵
//
//=============================================================================
#ifndef _FIND_WOLF_CAMERA_H_
#define _FIND_WOLF_CAMERA_H_

#include "camera.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// ゲームカメラクラス
//*****************************************************************************
class CFindWolfCamera : public CCamera
{
public:
	CFindWolfCamera();		//デフォルトコンストラクタ
	~CFindWolfCamera();	//デストラクタ
	static CFindWolfCamera* Create(void);	//生成処理
	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理

private:

};

#endif // !_FIND_WOLF_CAMERA_H_