//=============================================================================
//
// ロードUI処理 [loading_ui.h]
// Author : 加藤瑞葵
//
//=============================================================================
#ifndef _LOADING_UI_H_
#define _LOADING_UI_H_

#include "object2D.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
//前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CLoadingUi : public CObject2D
{
public:
	CLoadingUi();		//デフォルトコンストラクタ
	~CLoadingUi();		//デストラクタ
	static CLoadingUi* Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 size);	//生成処理
	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理
	void Draw(void);	//描画処理

private:
	int m_nFrameCounter;	//UIのフレームカウンタ
	int m_nAnimCounter;		//UIのアニメーションカウンタ
};

#endif // !_LOADING_UI_H_