//=============================================================================
//
// ゲーム選択シーン処理 [selectGameScene.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _SELECT_GAME_SCENE_H_
#define _SELECT_GAME_SCENE_H_

#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CObject2D;
class CSelectMenu3D;

//*****************************************************************************
// ゲーム選択シーンクラス
//*****************************************************************************
class CSelectGameScene : public CScene
{
public:
	CSelectGameScene();	//デフォルトコンストラクタ
	virtual ~CSelectGameScene();	//デストラクタ
	void Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理

private:
	int m_nFadeTime;	//フェード開始までのカウント
	bool m_bPushKey;	//選択キー押下時

	CSelectMenu3D* m_pMenuGame;	//開始するゲームの選択メニュー
};

#endif // !_SELECT_GAME_SCENE_H_